---
kind: method
id: M:Autodesk.Revit.DB.ReferencePointArray.Append(Autodesk.Revit.DB.ReferencePoint)
source: html/d5f6f632-753c-a342-aedc-0e206e21edc2.htm
---
# Autodesk.Revit.DB.ReferencePointArray.Append Method

## Syntax (C#)
```csharp
public virtual void Append(
	ReferencePoint item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.ReferencePoint`)